Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_qspi.h
/**
  * @brief    
  * @rmtoll   CCR    OPMODE    FL_QSPI_SetOperatingMode
  * @param    QSPIx QSPI instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_QSPI_OPERATION_MODE_WRITE
  *           @arg @ref FL_QSPI_OPERATION_MODE_READ
  *           @arg @ref FL_QSPI_OPERATION_MODE_QUERY
  *           @arg @ref FL_QSPI_OPERATION_MODE_MAP
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_SetOperatingMode(QSPI_Type* QSPIx, uint32_t mode)
{
    MODIFY_REG(QSPIx->CCR, QSPI_CCR_OPMODE_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   CCR    OPMODE    FL_QSPI_GetOperatingMode
  * @param    QSPIx QSPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_QSPI_OPERATION_MODE_WRITE
  *           @arg @ref FL_QSPI_OPERATION_MODE_READ
  *           @arg @ref FL_QSPI_OPERATION_MODE_QUERY
  *           @arg @ref FL_QSPI_OPERATION_MODE_MAP
  */
__STATIC_INLINE uint32_t FL_QSPI_GetOperatingMode(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CCR, QSPI_CCR_OPMODE_Msk));
}

/**
  * @brief    
  * @rmtoll   CCR    DMODE    FL_QSPI_SetDataMode
  * @param    QSPIx QSPI instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_QSPI_DATAT_MODE_NONE
  *           @arg @ref FL_QSPI_DATAT_MODE_SINGLE
  *           @arg @ref FL_QSPI_DATAT_MODE_DOUBLE
  *           @arg @ref FL_QSPI_DATAT_MODE_FOUR
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_SetDataMode(QSPI_Type* QSPIx, uint32_t mode)
{
    MODIFY_REG(QSPIx->CCR, QSPI_CCR_DMODE_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   CCR    DMODE    FL_QSPI_GetDataMode
  * @param    QSPIx QSPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_QSPI_DATA_MODE_NONE
  *           @arg @ref FL_QSPI_DATA_MODE_SINGLE
  *           @arg @ref FL_QSPI_DATA_MODE_DOUBLE
  *           @arg @ref FL_QSPI_DATA_MODE_FOUR
  */
__STATIC_INLINE uint32_t FL_QSPI_GetDataMode(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CCR, QSPI_CCR_DMODE_Msk));
}

/**
  * @brief    
  * @rmtoll   CCR    DUMCYC    FL_QSPI_WriteDummyCycle
  * @param    QSPIx QSPI instance
  * @param    cycle 
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_WriteDummyCycle(QSPI_Type* QSPIx, uint32_t cycle)
{
    MODIFY_REG(QSPIx->CCR, (0x1fU << 18U), (cycle << 18U));
}

/**
  * @brief    
  * @rmtoll   CCR    DUMCYC    FL_QSPI_ReadDummyCycle
  * @param    QSPIx QSPI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_QSPI_ReadDummyCycle(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CCR, (0x1fU << 18U)) >> 18U);
}

/**
  * @brief    
  * @rmtoll   CCR    ABSIZE    FL_QSPI_SetAlternateBytesSize
  * @param    QSPIx QSPI instance
  * @param    size This parameter can be one of the following values:
  *           @arg @ref FL_QSPI_AB_SIZE_8bits
  *           @arg @ref FL_QSPI_AB_SIZE_16bits
  *           @arg @ref FL_QSPI_AB_SIZE_24bits
  *           @arg @ref FL_QSPI_AB_SIZE_32bits
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_SetAlternateBytesSize(QSPI_Type* QSPIx, uint32_t size)
{
    MODIFY_REG(QSPIx->CCR, QSPI_CCR_ABSIZE_Msk, size);
}

/**
  * @brief    
  * @rmtoll   CCR    ABSIZE    FL_QSPI_GetAlternateBytesSize
  * @param    QSPIx QSPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_QSPI_AB_SIZE_8bits
  *           @arg @ref FL_QSPI_AB_SIZE_16bits
  *           @arg @ref FL_QSPI_AB_SIZE_24bits
  *           @arg @ref FL_QSPI_AB_SIZE_32bits
  */
__STATIC_INLINE uint32_t FL_QSPI_GetAlternateBytesSize(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CCR, QSPI_CCR_ABSIZE_Msk));
}

/**
  * @brief    
  * @rmtoll   CCR    ABMODE    FL_QSPI_SetAlternateBytesMode
  * @param    QSPIx QSPI instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_QSPI_AB_MODE_NONE
  *           @arg @ref FL_QSPI_AB_MODE_SINGLE
  *           @arg @ref FL_QSPI_AB_MODE_DOUBLE
  *           @arg @ref FL_QSPI_AB_MODE_FOUR
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_SetAlternateBytesMode(QSPI_Type* QSPIx, uint32_t mode)
{
    MODIFY_REG(QSPIx->CCR, QSPI_CCR_ABMODE_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   CCR    ABMODE    FL_QSPI_GetAlternateBytesMode
  * @param    QSPIx QSPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_QSPI_AB_MODE_NONE
  *           @arg @ref FL_QSPI_AB_MODE_SINGLE
  *           @arg @ref FL_QSPI_AB_MODE_DOUBLE
  *           @arg @ref FL_QSPI_AB_MODE_FOUR
  */
__STATIC_INLINE uint32_t FL_QSPI_GetAlternateBytesMode(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CCR, QSPI_CCR_ABMODE_Msk));
}

/**
  * @brief    
  * @rmtoll   CCR    ADSIZE    FL_QSPI_SetAddressSize
  * @param    QSPIx QSPI instance
  * @param    size This parameter can be one of the following values:
  *           @arg @ref FL_QSPI_AD_SIZE_8bits
  *           @arg @ref FL_QSPI_AD_SIZE_16bits
  *           @arg @ref FL_QSPI_AD_SIZE_24bits
  *           @arg @ref FL_QSPI_AD_SIZE_32bits
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_SetAddressSize(QSPI_Type* QSPIx, uint32_t size)
{
    MODIFY_REG(QSPIx->CCR, QSPI_CCR_ADSIZE_Msk, size);
}

/**
  * @brief    
  * @rmtoll   CCR    ADSIZE    FL_QSPI_GetAddressSize
  * @param    QSPIx QSPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_QSPI_AD_SIZE_8bits
  *           @arg @ref FL_QSPI_AD_SIZE_16bits
  *           @arg @ref FL_QSPI_AD_SIZE_24bits
  *           @arg @ref FL_QSPI_AD_SIZE_32bits
  */
__STATIC_INLINE uint32_t FL_QSPI_GetAddressSize(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CCR, QSPI_CCR_ADSIZE_Msk));
}

/**
  * @brief    
  * @rmtoll   CCR    ADMODE    FL_QSPI_SetAddressMode
  * @param    QSPIx QSPI instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_QSPI_AD_MODE_NONE
  *           @arg @ref FL_QSPI_AD_MODE_SINGLE
  *           @arg @ref FL_QSPI_AD_MODE_DOUBLE
  *           @arg @ref FL_QSPI_AD_MODE_FOUR
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_SetAddressMode(QSPI_Type* QSPIx, uint32_t mode)
{
    MODIFY_REG(QSPIx->CCR, QSPI_CCR_ADMODE_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   CCR    ADMODE    FL_QSPI_GetAddressMode
  * @param    QSPIx QSPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_QSPI_AD_MODE_NONE
  *           @arg @ref FL_QSPI_AD_MODE_SINGLE
  *           @arg @ref FL_QSPI_AD_MODE_DOUBLE
  *           @arg @ref FL_QSPI_AD_MODE_FOUR
  */
__STATIC_INLINE uint32_t FL_QSPI_GetAddressMode(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CCR, QSPI_CCR_ADMODE_Msk));
}

/**
  * @brief    
  * @rmtoll   CCR    IMODE    FL_QSPI_SetInstructionMode
  * @param    QSPIx QSPI instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_QSPI_IMODE_NONE
  *           @arg @ref FL_QSPI_IMODE_SINGLE
  *           @arg @ref FL_QSPI_IMODE_DOUBLE
  *           @arg @ref FL_QSPI_IMODE_FOUR
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_SetInstructionMode(QSPI_Type* QSPIx, uint32_t mode)
{
    MODIFY_REG(QSPIx->CCR, QSPI_CCR_IMODE_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   CCR    IMODE    FL_QSPI_GetInstructionMode
  * @param    QSPIx QSPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_QSPI_IMODE_NONE
  *           @arg @ref FL_QSPI_IMODE_SINGLE
  *           @arg @ref FL_QSPI_IMODE_DOUBLE
  *           @arg @ref FL_QSPI_IMODE_FOUR
  */
__STATIC_INLINE uint32_t FL_QSPI_GetInstructionMode(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CCR, QSPI_CCR_IMODE_Msk));
}

/**
  * @brief    
  * @rmtoll   CCR    INSTRUCTION    FL_QSPI_WriteInstruction
  * @param    QSPIx QSPI instance
  * @param    instruction 
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_WriteInstruction(QSPI_Type* QSPIx, uint32_t instruction)
{
    MODIFY_REG(QSPIx->CCR, (0xffU << 0U), (instruction << 0U));
}

/**
  * @brief    
  * @rmtoll   CCR    INSTRUCTION    FL_QSPI_ReadInstruction
  * @param    QSPIx QSPI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_QSPI_ReadInstruction(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CCR, (0xffU << 0U)) >> 0U);
}

/**
  * @brief    
  * @rmtoll   ADDR    ADDR    FL_QSPI_WriteAddress
  * @param    QSPIx QSPI instance
  * @param    address 
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_WriteAddress(QSPI_Type* QSPIx, uint32_t address)
{
    MODIFY_REG(QSPIx->ADDR, (0xffffffffU << 0U), (address << 0U));
}

/**
  * @brief    
  * @rmtoll   ADDR    ADDR    FL_QSPI_ReadAddress
  * @param    QSPIx QSPI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_QSPI_ReadAddress(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->ADDR, (0xffffffffU << 0U)) >> 0U);
}

/**
  * @brief    
  * @rmtoll   ABR    ABR    FL_QSPI_WriteAlternateBytes
  * @param    QSPIx QSPI instance
  * @param    alternate 
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_WriteAlternateBytes(QSPI_Type* QSPIx, uint32_t alternate)
{
    MODIFY_REG(QSPIx->ABR, (0xffffffffU << 0U), (alternate << 0U));
}

/**
  * @brief    
  * @rmtoll   ABR    ABR    FL_QSPI_ReadAlternateBytes
  * @param    QSPIx QSPI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_QSPI_ReadAlternateBytes(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->ABR, (0xffffffffU << 0U)) >> 0U);
}

/**
  * @brief    
  * @rmtoll   DR    DATA    FL_QSPI_WriteData
  * @param    QSPIx QSPI instance
  * @param    data 
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_WriteData(QSPI_Type* QSPIx, uint32_t data)
{
    MODIFY_REG(QSPIx->DR, (0xffffffffU << 0U), (data << 0U));
}

/**
  * @brief    
  * @rmtoll   DR    DATA    FL_QSPI_ReadData
  * @param    QSPIx QSPI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_QSPI_ReadData(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->DR, (0xffffffffU << 0U)) >> 0U);
}

/**
  * @brief    
  * @rmtoll   SMSK    SMSK    FL_QSPI_WriteStatusMask
  * @param    QSPIx QSPI instance
  * @param    mask 
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_WriteStatusMask(QSPI_Type* QSPIx, uint32_t mask)
{
    MODIFY_REG(QSPIx->SMSK, (0xffffffffU << 0U), (mask << 0U));
}

/**
  * @brief    
  * @rmtoll   SMSK    SMSK    FL_QSPI_ReadStatusMask
  * @param    QSPIx QSPI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_QSPI_ReadStatusMask(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->SMSK, (0xffffffffU << 0U)) >> 0U);
}

/**
  * @brief    
  * @rmtoll   SMAT    SMAT    FL_QSPI_WriteStatusMatch
  * @param    QSPIx QSPI instance
  * @param    match 
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_WriteStatusMatch(QSPI_Type* QSPIx, uint32_t match)
{
    MODIFY_REG(QSPIx->SMAT, (0xffffffffU << 0U), (match << 0U));
}

/**
  * @brief    
  * @rmtoll   SMAT    SMAT    FL_QSPI_ReadStatusMatch
  * @param    QSPIx QSPI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_QSPI_ReadStatusMatch(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->SMAT, (0xffffffffU << 0U)) >> 0U);
}

/**
  * @brief    
  * @rmtoll   PITV    PITV    FL_QSPI_WritePollingInterval
  * @param    QSPIx QSPI instance
  * @param    interval 
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_WritePollingInterval(QSPI_Type* QSPIx, uint32_t interval)
{
    MODIFY_REG(QSPIx->PITV, (0xffffU << 0U), (interval << 0U));
}

/**
  * @brief    
  * @rmtoll   PITV    PITV    FL_QSPI_ReadPollingInterval
  * @param    QSPIx QSPI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_QSPI_ReadPollingInterval(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->PITV, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    
  * @rmtoll   TO    TO    FL_QSPI_WriteTimeoutPeriod
  * @param    QSPIx QSPI instance
  * @param    period 
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_WriteTimeoutPeriod(QSPI_Type* QSPIx, uint32_t period)
{
    MODIFY_REG(QSPIx->TOR, (0xffffU << 0U), (period << 0U));
}

/**
  * @brief    
  * @rmtoll   TO    TO    FL_QSPI_ReadTimeoutPeriod
  * @param    QSPIx QSPI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_QSPI_ReadTimeoutPeriod(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->TOR, (0xffffU << 0U)) >> 0U);
}

/**
  * @}
  */

/** @defgroup QSPI_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_QSPI_Init(QSPI_Type *QSPIx, QSPI_InitTypeDef  *QSPI_InitStruct);
void FL_QSPI_StructInit(QSPI_InitTypeDef  *QSPI_InitStruct);
FL_ErrorStatus FL_QSPI_DeInit(QSPI_Type *QSPIx);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33HT0XXA_FL_QSPI_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2024-01-06*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
